WITH opp_selected_info AS (
    SELECT 
        s_o.Имя_агента,
        s_o.Идентификатор_сделки,
        s_o.Название_продукта,
        s_o.Статус_сделки,
        s_o.Цена_сделки,
        s_p.Прогнозная_стоимость_товара,
        (Работа_по_сделке_окончена - Активная_стадия_с) AS Дней_на_сделку
    FROM {{ ref('stg_opportunities') }} s_o
    LEFT JOIN {{ ref('stg_products')}} AS s_p ON s_o.Название_продукта = s_p.Название_продукта
),
succ_deals AS (
    SELECT Имя_агента,
    Цена_сделки,
    Прогнозная_стоимость_товара,
    (Цена_сделки - Прогнозная_стоимость_товара) Разн
    FROM opp_selected_info
    WHERE Статус_сделки = 'Сделка заключена'
)
SELECT 
    o_s_i.Имя_агента,
    SUM(o_s_i.Цена_сделки) AS Сумма_сделок_агент,
    COUNT(o_s_i.Статус_сделки) AS Всего_сделок_агент,
    ROUND(AVG(o_s_i.Цена_сделки) FILTER (WHERE o_s_i.Цена_сделки > 0), 2)  AS Средняя_цена_сделки_агент,
    PERCENTILE_DISC (0.5) WITHIN GROUP (ORDER BY o_s_i.Цена_сделки) FILTER (WHERE o_s_i.Цена_сделки > 0) AS Медианная_сумма_сделки_действительная,
    SUM(s_d.Разн) AS Маржа,
    ROUND(AVG(s_d.Разн), 3) AS Типичное_отклонение_по_1_сделке,
    ROUND(AVG((s_d.Цена_сделки - s_d.Прогнозная_стоимость_товара) / NULLIF(s_d.Прогнозная_стоимость_товара, 0)) * 100, 2) Процент_ошибок,
    COUNT(DISTINCT o_s_i.Идентификатор_сделки) AS Кол_во_сделок_агент,
    COUNT(DISTINCT o_s_i.Название_продукта) AS Кол_во_уникальных_продуктов_агент,
    SUM(CASE WHEN o_s_i.Статус_сделки = 'Сделка заключена' THEN 1 ELSE 0 END) AS Заключено_сделок_агент,
    SUM(CASE WHEN o_s_i.Статус_сделки = 'Сделка не состоялась' THEN 1 ELSE 0 END) AS Неудачных_сделок_агент,
    SUM(CASE WHEN o_s_i.Статус_сделки IN ('Работа с клиентом', 'Разведка') THEN 1 ELSE 0 END) AS Сделок_в_работе_агент,
    ROUND(SUM(o_s_i.Дней_на_сделку) / NULLIF(COUNT(DISTINCT o_s_i.Идентификатор_сделки), 0)) AS Среднее_дней_на_сделку_агент
FROM opp_selected_info o_s_i
LEFT JOIN succ_deals s_d ON o_s_i.Имя_агента = s_d.Имя_агента
GROUP BY 1
ORDER BY Сумма_сделок_агент DESC
 